[
    {
        "id": 1,
        "title": "حلم اشرف",
        "titleEn": "Eşref'in rüyası",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763496970491_b3rzrb.png",
        "description": "انضم أشرف إلى المافيا وأصبح أحد أقوى رجالها، بينما يواصل بحثه لسنوات عن فتاة حلم بها وأسماها رؤيا. يقع في حب نيسان، دون أن يدرك أنها هي نفسها رؤيا، وأنها تعمل سراً كمخبرة للشرطة، ليجد نفسه عالقًا بين الحب والخيانة والصراع...",
        "episodes": ["SNFSFNPLZS", "SNFSFNPLZS", "v3l9494", "v3l94b8"],
        "rumbleEpisodes": ["v6z5ujg", "AE7PZDK1", "v9a2b3c", "v4d5e6f"],
        "episodeDetails": [
            "الحلقة 1: الحلقة الأولى تقدم أشرف كرجل خرج من ماض صعب ودخل عالم الجريمة لكنه ما زال يحمل حلما قديما عن فتاة من طفولته وأثناء وجوده في حفل يلتقي بنيسان التي تجذبه بشدة وتخفي سرا يخلق بداية صراع بين ماضيه وحياته الجديدة.",
            "الحلقة 2: الحلقة الثانية تظهر اشتداد تعلق أشرف بنيسان بينما يزداد قلقه من الأسرار التي تشعره بأنها ليست كما تبدو وتبدأ الشكوك بالظهور داخله خاصة مع توسع نفوذه في عالمه المظلم مما يجعله ممزقا بين انجذابه لها وبين الخطر الذي قد تجلبه عليه.",
            "الحلقة 3: الحلقة الثالثة تركز على محاولة أشرف فهم حقيقة نيسان أكثر بينما يزداد اقترابه منها رغم الخوف الذي يشعر به وكلما حاول الابتعاد يعود ليجد نفسه أسيرا لمشاعره وفي الوقت نفسه تتصاعد تهديدات من عالمه القديم مما يضعه في وضع صعب بين قلبه وماضيه",
            "الحلقة 4: الحلقة الرابعة تكشف بداية تورط أشرف في مشكلة جديدة ناتجة عن صراع داخل عالمه بينما تحاول نيسان أن تبقى قريبة منه رغم قلقها من اكتشافه لأسرارها ويجد أشرف نفسه محاصرا بين خطر يقترب منه وعلاقة يريد حمايتها مما يزيد التوتر ويقوده لقرارات غير متوقعة",
            "الحلقة 5: الحلقة الخامسة تبدأ بتزايد الضغط على أشرف بعد أن تخرج الأمور عن سيطرته فيتعمق شكه في كل ما حوله وتزداد خطورة الموقف بينما تظهر بوادر مواجهة مقبلة بينه وبين خصومه في الوقت نفسه تحاول نيسان تهدئته لكنها تخشى أن ينكشف سرها مما يجعل العلاقة بينهما أكثر حساسية ويضعهما على حافة انفجار جديد.",
            "الحلقة 6: الحلقة السادسة تكشف دخول أشرف في مرحلة أخطر بعد أن تتسع دائرة التهديدات حوله ويبدأ يشعر أن الخيانة أصبحت قريبة جدا منه بينما تحاول نيسان الحفاظ على توازنها بين مهمتها ومشاعرها تجاهه فيزداد الصراع داخل أشرف بين رغبته في الثقة ورغبته في حماية نفسه ويقترب بذلك من لحظة قد تغير كل شيء.",
            "الحلقة 7: الحلقة السابعة تشتد فيها الضغوط على أشرف بعد أن تتقاطع مصالحه مع أعداء جدد ويشعر أن الدائرة تضيق أكثر حوله بينما تتورط نيسان بشكل أعمق في عالمه وتصبح مهددة بدورها فيزداد خوفه عليها ويتصاعد القلق بينهما ليقترب كل شيء من منعطف حاد قد يقلب ميزان القوة والعلاقة معا.",
            " الحلقة 8: الحلقة الثامنة تزداد فيها حدة الأحداث بعدما يكتشف أشرف خيطا يقوده إلى سر خطير يغير نظرته لكل من حوله بينما تصبح نيسان أقرب للانكشاف ويبدأ أشرف يشعر بأن شيئا كبيرا يُخبأ عنه فيتقدم خطوة نحو الحقيقة وخطوة نحو الخطر.",
            "الحلقة 9: الحلقة التاسعة يقترب فيها أشرف من كشف الحقيقة كاملة لكن كلما اقترب اشتدت الهجمات ضده ويجد نفسه محاصرا من أعداء يريدون إسقاطه بينما نيسان تعيش صراعا مؤلما بين حبها له وواجبها السري فيزداد التوتر بينهما ويصبح المستقبل أكثر غموضا.",
            " الحلقة 10: الحلقة العاشرة تصل فيها الأحداث إلى ذروة أولى حين يتعرض أشرف لخيانة صادمة تهز ثقته بكل الأشخاص المقربين منه وتدفعه للرد بقوة بينما تواجه نيسان لحظة حاسمة قد تكشف حقيقتها بالكامل فيصبح كل ما بينهما مهددا وينفتح الباب لمرحلة جديدة من الصدام والانتقام."
        ],
        "year": 2025,
        "trailerId": "SNFSFNPLZS",
        "isNew": true
    },
    {
        "id": 2,
        "title": "الحب لا يفهم الكلام",
        "titleEn": "Aşk Laftan Anlamaz",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763496852723_wudcyb.png",
        "description": "القصة تدور حول حياة، فتاة جميلة ومرحة تنتقل من الريف إلى اسطنبول وتبحث عن عمل في أقل من 24 ساعة لكي لا تجبرها عائلتها على العودة إلى القرية. وخلال بحثها تجد نفسها في صراع مع رئيسها (مراد) الوسيم لكنهما يقعان في الحب وتتوالى الأحداث الشيقة.",
        "episodes": ["v3l908a", "AE7PZDK1"],
        "episodeDetails": [
            "الحلقة 1: حياة في اسطنبول. تبدأ حياة رحلة البحث عن عمل وتصطدم بـ مراد.",
            "الحلقة 2: سوء التفاهم. يتصاعد التوتر بين حياة ومراد بسبب سوء تفاهم كبير."
        ],
        "year": 2016,
        "trailerId": "v3l924k",
        "isNew": false
    },
    {
        "id": 3,
        "title": "ورود ودنوب",
        "titleEn": "Güller ve günahlar",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763497308667_znzamn.png",
        "description": "القصة تدور حول الفتاة الجميلة صانم (ديميت أوزديمير) التي تعمل في متجر بقالة والدها وتضطر للبحث عن عمل بعدما وضع والدها حداً لعملها في البقالة، لتعمل في وكالة إعلانات حيث تلتقي بـ جان (جان يامان) المصور المشهور والمتهور، ويقعان في علاقة حب كوميدية مليئة بالمغامرات.",
        "episodes": ["v3l97u6", "v3l983a", "v3l98b4"],
        "episodeDetails": [
            "الحلقة 1: بداية المغامرة. تنتقل صانم للعمل في وكالة الإعلانات وتلتقي بجان للمرة الأولى.",
            "الحلقة 2: كذبة صغيرة. تقع صانم في كذبة صغيرة للحفاظ على وظيفتها.",
            "الحلقة 3: ليلة الأوبرا. يقضي جان وصانم ليلة مليئة بالأحداث الغريبة في الأوبرا."
        ],
        "year": 2025,
        "trailerId": "v3l98v6",
        "isNew": true
    },
    {
        "id": 4,
        "title": "المحتالون",
        "titleEn": "dolandırıcılar",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763497410968_q503zn.png",
        "description": "مسلسل تاريخي تركي يروي قصة الغازي أرطغرل، والد عثمان الأول مؤسس الدولة العثمانية. يعرض المسلسل رحلة أرطغرل في البحث عن وطن لقبيلته، ويصوّر صراعه مع الخونة والصليبيين والمغول. ملحمة تاريخية ضخمة تظهر قيم الشجاعة والعدالة...",
        "episodes": ["v3la0a4", "v3la0f2", "v3la0k8", "v3la0q4", "v3la0v2"],
        "episodeDetails": [
            "الحلقة 1: ميلاد الأسطورة. يواجه أرطغرل تحديات القبيلة الأولى.",
            "الحلقة 2: خيانة القلعة. يكشف أرطغرل أول مؤامرة ضده.",
            "الحلقة 3: السهم القاتل. معركة كبرى تقلب موازين القوى.",
            "الحلقة 4: طريق الهجرة. يبدأ أرطغرل رحلة البحث عن أرض جديدة.",
            "الحلقة 5: المؤسس. يضع أرطغرل اللبنة الأولى للدولة."
        ],
        "year": 2025,
        "trailerId": "v3la1i8",
        "isNew": true
    },
    {
        "id": 5,
        "title": "مرعشلي",
        "titleEn": "مرعشلي",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763497590858_gn9jnr.png",
        "description": "ويحكي المسلسل قصة جندي سابق من.كهرمان مرعش. ترك عمله في القوات الخاصة، واتجه لقضاء حياته في متجر للكتب المستعملة. وكانت نقطة تحول حياة المرعشلي الشجاع والجريء بعد إصابة ابنته.زيليش. بطلق ناري، ليصبح هدفه الوحيد بعد ذلك إعادة ابنته المريضة للحياة.",
        "episodes": ["v3lB101", "v3lB102"],
        "episodeDetails": [
            "الحلقة 1: الانطلاق. تبدأ رحلة كشف الأسرار والجذور.",
            "الحلقة 2: الماضي يطرق الباب. أولى الصدامات بين الشخصيات."
        ],
        "year": 2025,
        "trailerId": "v3lB1T1",
        "isNew": true
    },
    {
        "id": 6,
        "title": "شخص آخر",
        "titleEn": "başka bir kiş",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763497716826_jhxvcn.png",
        "description": "ليلى غيديز ، المدعية العائدة حديثاً إلى إسطنبول، تتولى قضية جريمة هزت تركيا. تتعاون مع كينان أوزتورك، مقدم الأخبار الشهير ، وسرعان ما ينشأ بينهما جاذبية، لكنهما يجهلان مدى قرب القاتل اليهما. الجريمة تكشف دوافعها، ويتساءل الناس هل القاتل جانيًا أم بطلاً، مما يضع تحالف ليلى وكينان وعلاقتهما في اختبار",
        "episodes": ["v3lC201", "v3lC202"],
        "episodeDetails": [
            "الحلقة 1: أول لقاء. تبدأ المواقف الكوميدية بين البطلين.",
            "الحلقة 2: سوء تفاهم رومانسي. محاولة فاشلة للتفاهم."
        ],
        "year": 2025,
        "trailerId": "v3lC2T1",
        "isNew": true
    },
    {
        "id": 7,
        "title": "أنت اطرق بابي",
        "titleEn": "Kapımı çal",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763497886420_p9zds.png",
        "description": "ايدا التي تعلق كل آمالها في الحياة بتعليمها، تواجه سيركان بولات الذي يقطع منحتها الى خارج البلد و يتسبب ببقائها خريجة ثانوية فحسب. سيركان يعرض على ايدا ارجاع منحتها لها في حال تظاهرت بخطوبتها له لمدة شهرين. في البداية ترفض ايدا عرض هذا الرجل الذي تكرهه، و لكنها تضطر للقبول عندما تتغير ظروفها. بينما يتظاهر سيركان و ايدا بأنهما مخطوبان، يدخلان في علاقة شغوفة و صعبة تنسيهما كل ما يعرفان عن الصواب!",
        "episodes": ["v3lD301", "v3lD302"],
        "episodeDetails": [
            "الحلقة 1: الهوية المخفية. عودة ميرا من أمريكا وبداية عملها السري.",
            "الحلقة 2: انجذاب غير متوقع. لقاء ميرا وسليم الأول."
        ],
        "year": 2025,
        "trailerId": "v3lD3T1",
        "isNew": true
    },
    {
        "id": 8,
        "title": "المدينة البعيدة",
        "titleEn": "Uzak şehir",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763498118272_ya1obj.png",
        "description": "تأتي عليا ألبورا من كندا إلى ماردين مع ابنها ذي الخمس سنوات وجثمان زوجها لتنفيذ وصيته، لكنها تجد نفسها محاصرة في أراضي عائلة ألبورا دون إمكانية المغادرة. تواجه عليا صراعات مع عائلة زوجها وسط النزاعات العشائرية والتعصب الإقطاعي، محاولةً كشف أسرار الماضي وإنقاذ ابنها في الوقت نفسه.",
        "episodes": ["v3lE401", "v3lE402"],
        "episodeDetails": [
            "الحلقة 1: المدخل الغامض. ظهور الرجل الغريب في حياة البطلة.",
            "الحلقة 2: تقاطع الطرق. بداية الكشف عن الأسرار المشتركة."
        ],
        "year": 2025,
        "trailerId": "v3lE4T1",
        "isNew": true
    },
    {
        "id": 9,
        "title": "المنضمة",
        "titleEn": "TeşkiLat",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763498402652_wc3lw.png",
        "description": "ينفذ هجوم ارهابي في مصنع للطائرات في أنقرة. بعد هذا الهجوم، يتم تأسيس فريق سري للغاية في منظمة الاستخبارات الوطنية. سيتخلى أعضاء هذا الفريق عن حياتهم من أجل بلدهم في محاولة لتحديد الجهة المسؤولة عن هذه الهجمات.",
        "episodes": ["v3lF501"],
        "episodeDetails": [
            "الحلقة 1: ضريبة الحب. المواجهة الأولى مع ماضي العائلتين."
        ],
        "year": 2025,
        "trailerId": "v3lF5T1",
        "isNew": true
    },
    {
        "id": 10,
        "title": "ليلى",
        "titleEn": "Leyla",
        "image": "https://wulaopnlopmcwfdritjj.supabase.co/storage/v1/object/public/images/2253b6c9-dc6e-4aed-881b-2e787bafd0b2/1763498531898_r1mq2v.png",
        "description": "يتناول المسلسل قصة ليلى، فتاة يتيمة الأم تعاني من قسوة زوجة أبيها التي تتركها في مكب للنفايات. تعود ليلى بعد سنوات للانتقام، لتجد نفسها في صراع بين رغبتها في الثأر واختبارها بالحب في رحلة عاطفية مليئة بالتحديات.",
        "episodes": ["v3lG601"],
        "episodeDetails": [
            "الحلقة 1: البحث عن العدالة. لقاء البطل والصحفية وبداية رحلة النضال."
        ],
        "year": 2025,
        "trailerId": "v3lG6T1",
        "isNew": true
    }
]
